XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX6_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>iMX6_DFP</name>
  <description>NXP i.MX 6 Device Support and Examples</description>

  <requirements>
    <packages>
      <package vendor="ARM"  name="CMSIS"          version="5.1.0"/>
      <package vendor="ARM"  name="AMP"            version="1.0.0"/>
      <package vendor="Keil" name="ARM_Compiler"   version="1.3.0"/>
    </packages>
  </requirements>
  
  <releases>
    <release version="1.5.2" date="2020-03-31">
      Updated Example:
      - Terminating app_main thread with osThreadExit() to avoid endless loop
      - Updated debug launch configuration files.
      - Updated Linux_Application_TTY example to use latest Linaro GCC toolchain.
      - Corrected Inner Cacheability attributes for Translation Table TTBR0 in MMU config.
    </release>
    <release version="1.5.1" date="2018-10-29">
      Fixed device description of basic features.
      Added QSPI flash algorithms.
      Removed requirement for CMSIS-FreeRTOS pack.
    </release>
    <release version="1.5.0" date="2017-08-11">
      Added CMSIS-RTOS2 RTX5 and FreeRTOS examples for Cortex-A9 processor.
    </release>
    <release version="1.4.0" date="2017-07-12">
      Added support for i.MX 6SLL devices.
      Added ARM Compiler 6 support and examples.
      Updated RPMSG examples.
      Updated debug description for i.MX 6SoloX:
      - Removed unnecessary DebugPortSetup sequence
      - Split DebugPortStart sequence into Cortex-A9 and Cortex-M4 specific sequences
      - Restore previous Cortex-A9 debug/system power state after release of Cortex-M4 from reset
    </release>
    <release version="1.3.1" date="2017-04-13">
      Added pack requirements.
      Delisted FreeRTOS example as it requires unreleased CMSIS pack version.
    </release>
    <release version="1.3.0" date="2017-04-04">
      Added Startup and System files for Cortex-A9.
      Added FreeRTOS Blinky example for Cortex-A9.
      Added board support for the iMX6-SoloX-COM Board.
    </release>
    <release version="1.2.0" date="2017-01-20">
      Added support for i.MX 6ULL devices.
      Added devices into i.MX 6SoloX and i.MX 6UltraLite sub-families.
    </release>
    <release version="1.1.1" date="2016-12-07">
      Updated device header files' #pragma push/pop statements to support ARMClang 6.
      Updated SDF file for iMX6SX to block reset capability.
    </release>
    <release version="1.1.0" date="2016-11-23">
      Added device support for i.MX 6 UltraLite.
      Added QSPI flash algorithms.
      Updated SVD file iMX6SX_A9.svd to prevent SVDConv error
    </release>
    <release version="1.0.0">
      Initial device support for i.MX 6 SoloX.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>iMX6</keyword>
    <keyword>i.MX6</keyword>
    <keyword>i.MX 6SoloX</keyword>
    <keyword>i.MX 6UltraLite</keyword>
    <keyword>i.MX 6ULL</keyword>
    <keyword>i.MX 6SLL</keyword>
  </keywords>

  <devices>
    <family Dfamily="i.MX 6 Series" Dvendor="NXP:11">
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>
      <subFamily DsubFamily="i.MX 6SoloX">

        <!-- ******************************  i.MX 6SoloX  ****************************** -->

        <processor Dcore="Cortex-A9" DcoreVersion="r4p1" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A9" Dclock="1000000000"/>
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Pname="Cortex-M4" Dclock="227000000"/>

        <debugconfig default="jtag" swj="false" sdf="Debug/MCIMX6SX-SDB.sdf"/>

        <algorithm name="Flash/MCIMX6_QSPI2A_32.FLM" start="0x70000000"  size="0x02000000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
        <algorithm name="Flash/MCIMX6_QSPI2B_32.FLM" start="0x78000000"  size="0x02000000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="0"/>

        <description>
          The i.MX 6SoloX family introduces single cores running up to 1.0 GHz (Cortex-A9) and 227 MHz (Cortex-M4) with 256 KB
          of L2 cache and 32-bit DDR3/LPDDR2 support. Integrated LVDS, FlexCAN, and PCIe Express enables the i.MX 6SoloX to be
          a low-power and flexible platform for consumer, automotive and industrial applications that require real-time
          responsiveness and a higher level of system integrity.
          - Single Cortex-A9 up to 1.0 GHz
          - Single Cortex-M4 up to 200 MHz
          - 256 KB L2 cache, NEON, VFP, TrustZone
          - 3D and 2D graphics
          - 32-bit DDR3 and LPDDR2 at 400 MHz
          - Dual Gigabit Ethernet, MAC w/ hardware, AVB support
          - PCIe controller plus PHY
          - LVDS controller plus PHY
          - Analog camera interface
          - 8-channel, 12-bit ADC
          - MLB and FlexCAN controllers
        </description>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="Documents/IMX6SXRM.pdf"                title="i.MX 6SoloX Applications Processor Reference Manual"/>

        <feature type="Memory" n="32768" name="I-Cache"/>
        <feature type="Memory" n="32768" name="D-Cache"/>
        <feature type="Memory" n="262144" name="L2 Cache"/>

        <debug   Pname="Cortex-A9" svd="SVD/iMX6SX_A9.svd"/>
        <debug   Pname="Cortex-M4" svd="SVD/iMX6SX_M4.svd"/>
        <compile Pname="Cortex-M4" header="Device/Include/iMX6SX_M4.h"  define="iMX6SX_M4"/>
        <compile Pname="Cortex-A9" header="Device/Include/iMX6SX_A9.h"  define="iMX6SX_A9"/>
        <memory  Pname="Cortex-M4" id="IROM1"  start="0x00000000"  size="0x00008000" startup="1" default="1"/>
        <memory  Pname="Cortex-M4" id="IRAM1"  start="0x20000000"  size="0x00008000" init   ="0" default="1"/>

        <debugport __dp="0">
          <jtag tapindex="0" idcode="0x4BA00477" irlen="4"/>
        </debugport>
        <debugport __dp="1">
          <jtag tapindex="1" idcode="0x4BA00477" irlen="4"/>
        </debugport>
        <debugport __dp="2">
          <jtag tapindex="2" idcode="0x00000000" irlen="4"/>
        </debugport>
        <debugport __dp="3">
          <jtag tapindex="3" idcode="0x0891C01D" irlen="5"/>
        </debugport>

        <debug Pname="Cortex-A9" __dp="1" __ap="0"/>
        <debug Pname="Cortex-M4" __dp="0" __ap="0"/>

        <debugvars Pname="Cortex-M4" configfile="Debug/iMX6SX_M4.dbgconf">
          __var ReleaseM4 = 0x00000001;   // Enable &amp; Release Cortex-M4 from Reset
        </debugvars>

