XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX6_DFP.pdsc
        <sequences>
          <sequence name="DebugPortStartDefault_JTAG">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;

              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);

              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>

            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>

              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>

              <block>
                // Request Debug Reset
                WriteDP(DP_CTRL_STAT, 0x54000000);
              </block>

              <!-- Wait for Debug Reset to be acknowledged, don't issue error on timeout to deal with improperly connected Debug Reset -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA8000000) != 0xA8000000" timeout="300000"/>

              <block>
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                WriteDP(DP_CTRL_STAT, 0x50000F32);
              </block>
            </control>
          </sequence>

          <sequence name="DebugPortStart" Pname="Cortex-A9">
            <block>
              Sequence("DebugPortStartDefault_JTAG");     // Power Up actually requested Debug Port
            </block>
          </sequence>

          <sequence name="DebugPortStart" Pname="Cortex-M4">
            <block>
              // Store information about requested Debug Port
              __var DP_CTRL_STAT = 0x4;
              __var dpA9Stat     = 0;
            </block>

            <control if="ReleaseM4" info="Power Up Cortex-A9 Debug Port and Release Cortex-M4">
              <block>
                __dp     = 1;                                          // Switch to Cortex-A9 Debug Port
                dpA9Stat = ReadDP(DP_CTRL_STAT) &amp; 0xF0000000;      // Save Cortex-A9 Debug and System Power State

                Sequence("DebugPortStartDefault_JTAG");                // Power Up Cortex-A9 Debug Port

                // Bus Master Config - AIPSTZ0_MPR
                Write32(0x0207C000, Read32(0x0207C000) | 0x77000700);  // Master 0, 1 (ARM A9 Core), 5 (ARM M4 Core)
                Write32(0x0217C000, Read32(0x0217C000) | 0x77000700);  // Master 0, 1 (ARM A9 Core), 5 (ARM M4 Core)
                Write32(0x0227C000, Read32(0x0227C000) | 0x77000700);  // Master 0, 1 (ARM A9 Core), 5 (ARM M4 Core)

                // Enable All Clocks
                Write32(0x020C4068, 0xFFFFFFFF);
                Write32(0x020C406C, 0xFFFFFFFF);
                Write32(0x020C4070, 0xFFFFFFFF);
                Write32(0x020C4074, 0xFFFFFFFF);
                Write32(0x020C4078, 0xFFFFFFFF);
                Write32(0x020C407C, 0xFFFFFFFF);
                Write32(0x020C4080, 0xFFFFFFFF);
                Write32(0x020C4084, 0xFFFFFFFF);

                // Write Code to Memory
                Write32(0x007F8000, 0x20000000);
                Write32(0x007F8004, 0x00000009);
                Write32(0x007F8008, 0xE7FEE7FE);

                // SRC - Release M4
                Write32(0x020D8000, Read32(0x020D8000) | 0x50400281);  // Mask WDOGs, Enable M4, Enable warm reset
                Write32(0x020D8000, Read32(0x020D8000) &amp; ~0x10);   // Clear non-self-clearing SW reset for  M4
              </block>

              <control if="dpA9Stat != 0xF0000000">
                <block>
                  WriteDP(DP_CTRL_STAT, dpA9Stat);                     // Restore previous Cortex-A9 Debug and System Power State
                </block>
              </control>

              <block>
                __dp = 0;                                              // Switch back to Cortex-M4 Debug Port
              </block>
            </control>

            <block>
              Sequence("DebugPortStartDefault_JTAG");                  // Power Up actually requested Debug Port
            </block>
          </sequence>

          <sequence name="ResetSystem" Pname="Cortex-M4">
            <block>
              __var value = 0x00000000;

              // Write SRC_SCR[m4p_rst|m4c_rst] (Self-Clearing M4 Core + Platform Resets)
              value  = Read32(0x420D8000);
              value |= 0x00001008;          // m4p_rst + m4c_rst
              Write32(0x420D8000, value);
            </block>
            <control while="Read32(0x420D8000) &amp; 0x00001008" timeout="1000000" info="Wait for Self-Clearing M4 Core + Platform Resets to clear"/>
          </sequence>
        </sequences>

        <device Dname="MCIMX6X1"> </device>
        <device Dname="MCIMX6X2"> </device>
        <device Dname="MCIMX6X3"> </device>
        <device Dname="MCIMX6X4"> </device>

      </subFamily>

      <subFamily DsubFamily="i.MX 6UltraLite">

        <!-- ******************************  i.MX 6UltraLite  ****************************** -->

        <processor Dcore="Cortex-A7" DcoreVersion="r0p5" Dfpu="DP_FPU" Dmpu="MPU" Dclock="696000000"/>

        <debugconfig default="jtag" swj="false" sdf="Debug/MCIMX6UL.sdf"/>

        <description>
          The i.MX 6UltraLite is a high performance, ultra-efficient processor family featuring an advanced implementation of a single
          ARM Cortex-A7 core, which operates at speeds up to 696 MHz. The i.MX 6UltraLite applications processor includes an integrated
          power management module that reduces the complexity of external power supply and simplifies power sequencing.
          - Single Cortex-A7 up to 696 MHz
          - 128 KB L2 cache
          - Parallel LCD Display up to WXGA (1366x768)
          - 8/10/16/24-bit Parallel Camera Sensor Interface
          - 16-bit LP-DDR2, DDR3/DDR3L
          - 8/16-bit Parallel NOR FLASH / PSRAM
          - Dual-channel Quad-SPI NOR FLASH
          - 8-bit Raw NAND FLASH with 40-bit ECC
          - 2x MMC 4.5/SD 3.0/SDIO Port
          - 2x USB 2.0 OTG, HS/FS, Device or Host with PHY
          - Audio Interfaces include 3x I2S/SAI, S/PDIF Tx/Rx
          - 2x 10/100 Ethernet with IEEE 1588
          - 2x 12-bit ADC, up to 10 input channel total, with resistive touch controller (4-wire/5-wire)
          - Partial PMU Integration
          - Security Block: TRNG, Crypto Engine (AES with DPA, TDES/SHA/RSA), Tamper Monitor, Secure Boot, SIMV2/EVMSIM X 2, OTF DRAM
          - Encryption, PCI4.0 pre-certification
        </description>

        <book name="Documents/IMX6ULRM.pdf" title="i.MX 6UltraLite Applications Processor Reference Manual"/>

        <feature type="Memory" n="32768" name="I-Cache"/>
        <feature type="Memory" n="32768" name="D-Cache"/>
        <feature type="Memory" n="131072" name="L2 Cache"/>

        <memory id="IROM1"  start="0x00000000"  size="0x00008000" startup="1" default="1"/>
        <memory id="IRAM1"  start="0x20000000"  size="0x00008000" init   ="0" default="1"/>
 
        <debug svd="SVD/iMX6UL.svd"/>

        <device Dname="MCIMX6G0"> </device>
        <device Dname="MCIMX6G1"> </device>
        <device Dname="MCIMX6G2"> </device>
        <device Dname="MCIMX6G3"> </device>

      </subFamily>

