XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX6_DFP.pdsc
      <subFamily DsubFamily="i.MX 6ULL">

        <!-- ******************************  i.MX 6ULL  ****************************** -->

        <processor Dcore="Cortex-A7" DcoreVersion="r0p5" Dfpu="DP_FPU" Dmpu="MPU" Dclock="528000000"/>

        <debugconfig default="jtag" swj="false" sdf="Debug/MCIMX6UL.sdf"/>

        <description>
          The i.MX 6ULL is a power efficient and cost optimized applications processor family featuring an advanced implementation
          of a single ARM Cortex-A7 core, which operates at speeds up to 528 MHz. The i.MX 6ULL applications processor includes an
          integrated power management module that reduces the complexity of an external power supply and simplifies power sequencing.
          - Single Cortex-A7 up to 528 MHz
          - 128 KB L2 cache
          - Parallel LCD Display up to WXGA (1366x768)
          - 8/10/16/24-bit Parallel Camera Sensor Interface
          - Electrophoretic display controller support direct-driver for E-Ink EPD panel, with up to 2048x1536 resolution at 106 Hz
          - 16-bit LP-DDR2, DDR3/DDR3L
          - 8/16-bit Parallel NOR FLASH / PSRAM
          - Dual-channel Quad-SPI NOR FLASH
          - 8-bit Raw NAND FLASH with 40-bit ECC
          - 2x MMC 4.5/SD 3.0/SDIO Port
          - 2x USB 2.0 OTG, HS/FS, Device or Host with PHY
          - Audio Interfaces include 3x I2S/SAI, S/PDIF Tx/Rx
          - 2x 10/100 Ethernet with IEEE 1588
          - 2x 12-bit ADC, up to 10 input channel total, with resistive touch controller (4-wire/5-wire)
          - Partial PMU Integration
          - Security Block: TRNG, Crypto Engine (AES with DPA, TDES/SHA/RSA), Secure Boot
        </description>

        <book name="Documents/IMX6ULLRM.pdf" title="i.MX 6ULL Applications Processor Reference Manual"/>

        <feature type="Memory" n="32768" name="I-Cache"/>
        <feature type="Memory" n="32768" name="D-Cache"/>
        <feature type="Memory" n="131072" name="L2 Cache"/>

        <memory id="IROM1"  start="0x00000000"  size="0x00008000" startup="1" default="1"/>
        <memory id="IRAM1"  start="0x20000000"  size="0x00008000" init   ="0" default="1"/>

        <device Dname="MCIMX6Y0">
          <debug svd="SVD/MCIMX6Y0.svd"/>
        </device>
        <device Dname="MCIMX6Y1">
          <debug svd="SVD/MCIMX6Y1.svd"/>
        </device>
        <device Dname="MCIMX6Y2">
          <debug svd="SVD/MCIMX6Y2.svd"/>
        </device>
        <device Dname="MCIMX6Y7">
          <debug svd="SVD/MCIMX6Y7.svd"/>
        </device>

      </subFamily>
      
      <subFamily DsubFamily="i.MX 6SLL">

        <!-- ******************************  i.MX 6SLL  ****************************** -->

        <processor Dcore="Cortex-A9" DcoreVersion="r4p1" Dfpu="DP_FPU" Dmpu="MPU" Dclock="1000000000"/>

        <debugconfig default="jtag" swj="false" sdf="Debug/MCIMX6SLL.sdf"/>

        <description>
          The i.MX 6SLL processor represents NXP's latest achievement in integrated multimedia applications processors, which 
          are part of a growing family of multimedia-focused products that offer high performance processing and are optimized 
          for lowest power consumption.
          The processor features NXP's advanced implementation of a single ARM Cortex-A9, which operates at speeds up to 1GHz. 
          The processor provides a 32-bit DDR interface that supports LPDDR2 and LPDDR3. In addition, there are a number of 
          other interfaces for connecting peripherals, such as WLAN, Bluetooth, GPS, hard drive, displays, and camera sensors.
          Processor:
          - 1x ARM Cortex-A9 up to 1 GHz (with TrustZone)
          - 32 KByte L1 Instruction Cache
          - 32 KByte L1 Data Cache
          - Private Timer and Watchdog
          - Cortex-A9 NEON MPE (Media Processing Engine) co-processor
          Memory:
          - 32 bit LP-DDR2
          - 32 bit LPDDR3
          Connectivity:
          - 2x USB 2.0 OTG with PHY
          - 3x eMMC 5.0/SD 3.0
          - 3x I2S/SSI
          - 4x SPI, 5x UART, 3x I2C
          - S/PDIF Tx/Rx
          Display:
          - EPDC, color, and monochrome E-INK, up to 2332x1650 resolution and 5-bit grayscale, supporting Gen-II (REAGL/-D) Processing
          - Single Engine
          - 24-bit Parallel LCD Display 2D graphics processor PXP that can support CSC, dithering, rotation, resize, and overlay
        </description>

        <book name="Documents/iMX6SLL_RM_Rev_0.pdf" title="i.MX 6SLL Applications Processor Reference Manual"/>

        <feature type="Memory" n="32768" name="I-Cache"/>
        <feature type="Memory" n="32768" name="D-Cache"/>
        <feature type="Memory" n="262144" name="L2 Cache"/>

        <memory id="IROM1"  start="0x00000000"  size="0x00008000" startup="1" default="1"/>
        <memory id="IRAM1"  start="0x20000000"  size="0x00008000" init   ="0" default="1"/>

        <device Dname="MCIMX6V2">
          <debug svd="SVD/MCIMX6V2.svd"/>
        </device>

        <device Dname="MCIMX6V7">
          <debug svd="SVD/MCIMX6V7.svd"/>
        </device>
        
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="ARMCC6">
      <accept Tcompiler="ARMCC" Toptions="AC6"/>
      <accept Tcompiler="ARMCC" Toptions="AC6LTO"/>
    </condition>
    <condition id="ARMCC5">
      <require Tcompiler="ARMCC" Toptions="AC5"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="iMX6SX M4 CMSIS">
      <description>NXP iMX6SX CM4 devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MCIMX6X*"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <condition id="iMX6SX A9 CMSIS">
      <description>NXP iMX6SX CA9 devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MCIMX6X*"/>
      <require Dcore="Cortex-A9"/>
    </condition>

    <!-- Device + Core + CMSIS + HW Initialization -->
    <condition id="iMX6SX M4 CMSIS HW">
      <description>NXP iMX6SX CM4 devices, CMSIS-CORE and HW INIT</description>
      <require condition="iMX6SX M4 CMSIS"/>
      <require Cclass="Board Support" Cgroup="HW INIT"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="iMX6SX HAL" Csub="CCM"/>
      <require Cclass="Device" Cgroup="iMX6SX HAL" Csub="RDC"/>
      <require Cclass="Device" Cgroup="iMX6SX HAL" Csub="UART"/>
    </condition>
