XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX6_DFP.pdsc
  </conditions>

  <components>
    <!-- Startup iMX6SX-M4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="iMX6SX M4 CMSIS">
      <description>NXP iMX6SX CM4 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/AC5/startup_iMX6SX_M4.s" attr="config" version="1.0.0" condition="ARMCC5"/>
        <file category="source"  name="Device/Source/AC6/startup_iMX6SX_M4.s" attr="config" version="1.0.0" condition="ARMCC6"/> 
        <file category="source"  name="Device/Source/system_iMX6SX_M4.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Include/system_iMX6SX_M4.h"     attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup iMX6SX-A9 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="iMX6SX A9 CMSIS">
      <description>NXP iMX6SX CA9 devices</description>
      <files>
        <file category="include"      name="Device/Include/"/>
        <file category="sourceC"      name="Device/Source/AC5/startup_iMX6SX_A9.c" version="1.0.0" attr="config" condition="ARMCC5"/>
        <file category="linkerScript" name="Device/Source/AC5/iMX6SX_A9.sct"       version="1.0.0" attr="config" condition="ARMCC5"/>
        <file category="sourceC"      name="Device/Source/AC6/startup_iMX6SX_A9.c" version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/Source/AC6/iMX6SX_A9.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="sourceC"      name="Device/Source/system_iMX6SX_A9.c"      version="1.0.0" attr="config"/>
        <file category="sourceC"      name="Device/Source/mmu_iMX6SX_A9.c"         version="1.1.0" attr="config"/>
        <file category="header"       name="Device/Include/system_iMX6SX_A9.h"     version="1.0.0" attr="config"/>
        <file category="header"       name="Device/Include/mem_iMX6SX_A9.h"        version="1.0.0" attr="config"/>
         
      </files>
    </component>

    <!-- Board Support -->
    <bundle Cbundle="MCIMX6SX-SABRE" Cclass="Board Support" Cversion="1.0.0">
      <description>iMX6SX SABRE Board</description>
      <doc></doc>
      <component Cgroup="User I/O Redirect" condition="iMX6SX M4 CMSIS HW">
        <description>User I/O Redirect to UART</description>
        <files>
          <file category="header" name="Common/retarget_io_user.h"/>
          <file category="source" name="Common/retarget_io_user.c"/>
        </files>
      </component>

      <component Cgroup="HW INIT" condition="iMX6SX M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/imx6sx_sdb_m4/board.c"/>
          <file category="header" name="SDK/examples/imx6sx_sdb_m4/board.h"/>
          <file category="source" name="SDK/examples/imx6sx_sdb_m4/clock_freq.c"/>
          <file category="header" name="SDK/examples/imx6sx_sdb_m4/clock_freq.h"/>
          <file category="source" name="SDK/examples/imx6sx_sdb_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/imx6sx_sdb_m4/pin_mux.h"/>
        </files>
      </component>
    </bundle>
    
    <bundle Cbundle="iMX6-SoloX-COM" Cclass="Board Support" Cversion="1.0.0">
      <description>iMX6 SoloX COM Board</description>
      <doc></doc>
      <component Cgroup="User I/O Redirect" condition="iMX6SX M4 CMSIS HW">
        <description>User I/O Redirect to UART</description>
        <files>
          <file category="header" name="Common/retarget_io_user.h"/>
          <file category="source" name="Common/retarget_io_user.c"/>
        </files>
      </component>

      <component Cgroup="HW INIT" condition="iMX6SX M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/imx6sx_com_m4/board.c"/>
          <file category="header" name="SDK/examples/imx6sx_com_m4/board.h"/>
          <file category="source" name="SDK/examples/imx6sx_com_m4/clock_freq.c"/>
          <file category="header" name="SDK/examples/imx6sx_com_m4/clock_freq.h"/>
          <file category="source" name="SDK/examples/imx6sx_com_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/imx6sx_com_m4/pin_mux.h"/>
        </files>
      </component>
    </bundle>
    
    <!-- iMX6SX HAL Drivers -->
    <component Cclass="Device" Cgroup="iMX6SX HAL" Csub="UART" Cversion="1.0.0" condition="iMX6SX M4 CMSIS">
      <description>Universal Asynchronous Receiver/Transmitter</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/uart_imx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/uart_imx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX6SX HAL" Csub="MU" Cversion="1.0.0" condition="iMX6SX M4 CMSIS">
      <description>Messaging Unit</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/mu_imx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/mu_imx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX6SX HAL" Csub="CCM" Cversion="1.0.0" condition="iMX6SX M4 CMSIS">
      <description>Clock Control Module</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/ccm_imx6sx.c"/>
        <file category="source"  name="SDK/platform/drivers/src/ccm_analog_imx6sx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/ccm_imx6sx.h"/>
        <file category="header"  name="SDK/platform/drivers/inc/ccm_analog_imx6sx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="iMX6SX HAL" Csub="RDC" Cversion="1.0.0" condition="iMX6SX M4 CMSIS">
      <description>Resource Domain Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/rdc.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/rdc.h"/>
      </files>
    </component>

  </components>

