XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.iMX6_DFP.pdsc
  <boards>
    <board name="MCIMX6SX-SABRE" vendor="NXP" revision="Rev. A2" orderForm="http://www.nxp.com/products/software-and-tools/hardware-development-tools/sabre-development-system/sabre-board-for-smart-devices-based-on-the-i.mx-6solox-applications-processors:RD-IMX6SX-SABRE">
      <description>The NXP Smart Application Blueprint for Rapid Engineering (SABRE) board for smart devices introduces developers to multicore processing, low-power consumption and leading-edge multimedia and graphics applications on the i.MX 6 series applications processors.</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX6X1"/>
      <image small="Images/MCIMX6SXSABRE_small.jpg" large="Images/MCIMX6SXSABRE_large.jpg"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin ARM Standard JTAG Connector"/>
      <book category="overview" name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/sabre-development-system/sabre-board-for-smart-devices-based-on-the-i.mx-6solox-applications-processors:RD-IMX6SX-SABRE" title="Overview Page"/>
      <book category="overview" name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/sabre-development-system/sabre-board-for-smart-devices-based-on-the-i.mx-6solox-applications-processors:RD-IMX6SX-SABRE?tab=In-Depth_Tab" title="Getting Started Page"/>
      <feature type="RAM" n="1" name="1GB, DDR3 SDRAM"/>
      <feature type="MemCard" n="3" name="Full-size SD/MMC card slots"/>
      <feature type="ETH" n="2" m="1000000000" name="RJ45"/>
      <feature type="USB" n="1" name="USB 2.0 Host Type A connector"/>
      <feature type="USB" n="1" name="micro USB 2.0 OTG connector"/>
      <feature type="CAN" n="2" name="DB9 male connector"/>
      <feature type="AIO" n="8" name="12bit ADC"/>
      <feature type="Other" n="1" name="mPCIe socket"/>
      <feature type="Accelerometer" n="1" name="NXP MMA8451 3-Axis Accelerometer"/>
      <feature type="Compass" n="1" name="NXP MAG3110 3D Magnetometer"/>
      <feature type="LineOut" n="1" name="3.5mm Stereo Headphone Jack"/>
      <feature type="MIC" n="1" name="Microphone"/>
      <feature type="Button" n="5" name="Push-Buttons for Power, Reset and User"/>
      <feature type="ConnOther" n="1" name="LVDS"/>
      <feature type="ConnOther" n="1" name="LCD Expansion Connector"/>
      <feature type="ConnOther" n="1" name="Camera Module Connector"/>
      <feature type="ConnOther" n="1" name="Silex Wi-Fi/BT Combo"/>
    </board>
    
    <board name="iMX6-SoloX-COM" vendor="Embedded Artists" orderForm="https://www.embeddedartists.com/products/kits/imx6solox_kit.php">
      <description>The iMX6 SoloX COM Developer's Kit contains the iMX7 Dual COM Board, the COM Adapter Board and the COM Carrier Board. </description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX6X4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MCIMX6X*"/>
      <!--<image small="Images/iMX7DualCOM_small.jpg" large="Images/iMX7DualCOM_large.jpg"/>-->      
      <book category="overview" name="https://www.embeddedartists.com/products/kits/imx6solox_kit.php" title="Overview Page"/>
      <feature type="RAM" n="1" name="1GB DDR3"/>
      <feature type="ROM" n="1" name="4GB eMMC"/>
      <feature type="MemCard" n="1" name="Micro SD Card slot"/>
      <feature type="ETH" n="2" m="1000000000" name="RJ45"/>
      <feature type="USB" n="2" name="USB Host Standard-A connector"/>
      <feature type="USB" n="1" name="USB-OTG Micro-AB connector"/>
      <feature type="CAN" n="2"/>
      <feature type="I2C" n="4"/>
      <feature type="SPI" n="4"/>
      <feature type="AIO" n="2"/>
      <feature type="LineOut" n="1" name="Analog Audio Line out"/>
      <feature type="Other" n="1" name="Mini PCIe socket"/>
      <feature type="Other" n="1" name="RTC"/>     
      <feature type="ConnOther" n="1" name="LVDS"/>
      <feature type="ConnOther" n="1" name="Parallel 24-bit RGB display interface"/>
      <feature type="ConnOther" n="3" name="UART FTDI compatible connector"/>
      <feature type="ConnOther" n="1" name="XBee compatible interface connector"/>
      <feature type="ConnOther" n="1" name="FPC connector for camera interface"/>
      <feature type="ConnOther" n="1" name="FPC connector for JTAG adapter"/>
      <feature type="CustomFF"  n="165" m="104"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky M4" doc="Abstract.txt" folder="Boards/NXP/MCIMX6SX-SABRE/Blinky_M4">
      <description>CMSIS-RTOS RTX Blinky example for Cortex-M4</description>
      <board name="MCIMX6SX-SABRE" vendor="NXP"/>
      <project>
        <environment name="uv"  load="MDK/Blinky_M4.uvprojx"/>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS2 Blinky M4" doc="Abstract.txt" folder="Boards/NXP/MCIMX6SX-SABRE/Blinky_M4_RTX5">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4</description>
      <board name="MCIMX6SX-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>
    
    <example name="CMSIS-RTOS2 Blinky M4 AC6" doc="Abstract.txt" folder="Boards/NXP/MCIMX6SX-SABRE/Blinky_M4_RTX5_AC6">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4 and ARMCC6</description>
      <board name="MCIMX6SX-SABRE" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

